In [ ]:
import pandas as pd


file_path = "tips.csv"  

df = pd.read_csv(file_path)

neumerical_cols = [df.select_dtypes(include=["number"])]
categorical_cols = [df.select_dtypes(exclude=["number"])]

print( neumerical_cols)
print(categorical_cols)

[     total_bill   tip  size
0         16.99  1.01     2
1         10.34  1.66     3
2         21.01  3.50     3
3         23.68  3.31     2
4         24.59  3.61     4
..          ...   ...   ...
239       29.03  5.92     3
240       27.18  2.00     2
241       22.67  2.00     2
242       17.82  1.75     2
243       18.78  3.00     2

[244 rows x 3 columns]]
[        sex smoker   day    time
0    Female     No   Sun  Dinner
1      Male     No   Sun  Dinner
2      Male     No   Sun  Dinner
3      Male     No   Sun  Dinner
4    Female     No   Sun  Dinner
..      ...    ...   ...     ...
239    Male     No   Sat  Dinner
240  Female    Yes   Sat  Dinner
241    Male    Yes   Sat  Dinner
242    Male     No   Sat  Dinner
243  Female     No  Thur  Dinner

[244 rows x 4 columns]]

In [28]:
import numpy as np

In [6]:
df.isnull().sum()

total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64

In [ ]:
# how to convert list into dataframe
# df = pd.DataFrame(list1)
n_data = pd.DataFrame(neumerical_cols[0])
# [0] is used to get the first column of the list

In [15]:
n_data

     total_bill   tip  size
0         16.99  1.01     2
1         10.34  1.66     3
2         21.01  3.50     3
3         23.68  3.31     2
4         24.59  3.61     4
..          ...   ...   ...
239       29.03  5.92     3
240       27.18  2.00     2
241       22.67  2.00     2
242       17.82  1.75     2
243       18.78  3.00     2

[244 rows x 3 columns]

In [18]:
n_data.isnull().sum()

total_bill    0
tip           0
size          0
dtype: int64

In [16]:
c_data = pd.DataFrame(categorical_cols[0])

In [17]:
c_data

        sex smoker   day    time
0    Female     No   Sun  Dinner
1      Male     No   Sun  Dinner
2      Male     No   Sun  Dinner
3      Male     No   Sun  Dinner
4    Female     No   Sun  Dinner
..      ...    ...   ...     ...
239    Male     No   Sat  Dinner
240  Female    Yes   Sat  Dinner
241    Male    Yes   Sat  Dinner
242    Male     No   Sat  Dinner
243  Female     No  Thur  Dinner

[244 rows x 4 columns]

In [19]:
c_data.isnull().sum()

sex       0
smoker    0
day       0
time      0
dtype: int64

In [ ]:
# there are no missing values 
# so there is no need to use simple imputer

In [20]:
from sklearn.preprocessing import StandardScaler

In [21]:
c_data['sex'] = c_data["sex"].map({"Male":1 , "Female":0})
c_data["smoker"] = c_data["smoker"].map({"No":1  ,"Yes":0})
c_data['day'] = c_data["day"].map({"Sun":0,"Mon":1 , "Tue":2 , "Wed":3 , "Thur":4 , "Fri":5 , "Sat":6})
c_data['time'] = c_data['time'].map({"Lunch":0 ,"Dinner":1})

In [22]:
c_data

     sex  smoker  day  time
0      0       1    0     1
1      1       1    0     1
2      1       1    0     1
3      1       1    0     1
4      0       1    0     1
..   ...     ...  ...   ...
239    1       1    6     1
240    0       0    6     1
241    1       0    6     1
242    1       1    6     1
243    0       1    4     1

[244 rows x 4 columns]

In [ ]:
# now categorical data is converted to neumerical data

In [ ]:
# for categorical data 
x1 = c_data.drop(columns = ['sex'])
y1 = c_data['sex']

In [25]:
from sklearn.model_selection import train_test_split

In [26]:
x1_train , x1_test , y1_train , y1_test = train_test_split(x1,y1,test_size = 0.2 , random_state = 42)

In [ ]:
np.round(x1_train.describe(), 2)

       smoker     day    time
count  195.00  195.00  195.00
mean     0.62    3.55    0.73
std      0.49    2.52    0.45
min      0.00    0.00    0.00
25%      0.00    0.00    0.00
50%      1.00    4.00    1.00
75%      1.00    6.00    1.00
max      1.00    6.00    1.00

In [30]:
# for neumerical data 
x2 = n_data.drop(columns = ['tip'])
y2 = n_data['tip']

In [31]:
x2_train , x2_test , y2_train , y2_test = train_test_split(x2,y2,test_size = 0.2 , random_state = 42)

In [32]:
np.round(x2_train.describe(), 2)

       total_bill    size
count      195.00  195.00
mean        20.22    2.57
std          8.77    0.94
min          5.75    1.00
25%         13.66    2.00
50%         17.92    2.00
75%         24.86    3.00
max         50.81    6.00

In [33]:
# now to standardising the values

In [34]:
from sklearn.preprocessing import StandardScaler

In [35]:
si = StandardScaler()

In [38]:
x1_train_sc = si.fit_transform(x1_train)

In [39]:
x1_train_new = pd.DataFrame(x1_train_sc , columns = x1_train.columns)

In [40]:
np.round(x1_train_new.describe() , 2)

       smoker     day    time
count  195.00  195.00  195.00
mean    -0.00    0.00    0.00
std      1.00    1.00    1.00
min     -1.26   -1.41   -1.64
25%     -1.26   -1.41   -1.64
50%      0.79    0.18    0.61
75%      0.79    0.97    0.61
max      0.79    0.97    0.61

In [41]:
# now the categorical data is Standardised

In [42]:
x2_train_sc = si.fit_transform(x2_train)

In [43]:
x2_train_new = pd.DataFrame(x2_train_sc , columns = x2_train.columns)

In [44]:
np.round(x2_train_new.describe() , 2)

       total_bill    size
count      195.00  195.00
mean         0.00   -0.00
std          1.00    1.00
min         -1.65   -1.68
25%         -0.75   -0.61
50%         -0.26   -0.61
75%          0.53    0.45
max          3.50    3.65

In [45]:
# now the neumerical data is Standardised

In [46]:
# now to Normailse the Categorical data

In [47]:
from sklearn.preprocessing import MinMaxScaler

In [48]:
mn  = MinMaxScaler()

In [49]:
x1_train_mn = mn.fit_transform(x1_train)

In [50]:
x1_train_new_new = pd.DataFrame(x1_train_mn , columns = x1_train.columns)

In [51]:
np.round(x1_train_new_new.describe() , 2)

       smoker     day    time
count  195.00  195.00  195.00
mean     0.62    0.59    0.73
std      0.49    0.42    0.45
min      0.00    0.00    0.00
25%      0.00    0.00    0.00
50%      1.00    0.67    1.00
75%      1.00    1.00    1.00
max      1.00    1.00    1.00

In [52]:
x2_train_mn = mn.fit_transform(x2_train)

In [53]:
x2_train_new_new = pd.DataFrame(x2_train_mn , columns = x2_train.columns)

In [54]:
np.round(x2_train_new_new.describe() , 2)

       total_bill    size
count      195.00  195.00
mean         0.32    0.31
std          0.19    0.19
min          0.00    0.00
25%          0.18    0.20
50%          0.27    0.20
75%          0.42    0.40
max          1.00    1.00

In [55]:
# now both the data sets are standardized and normalized